biddr_api/app/controllers/api/v1/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
  def index
    auctions = Auction.order(created_at: :desc)

INSERT INTO "auctions" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "a"], ["body", "aasdfasdfasdfafdsadsffdsa"], ["created_at", "2019-12-03 00:35:54.588314"], ["updated_at", "2019-12-03 00:35:54.588314"], ["user_id", 1]]
---
  def create
    auction = Auction.new auction_params
    auction.user = current_user
    auction.save!

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def find_auction
    @auction ||= Auction.find params[:id]