biddr_api/app/controllers/api/v1/bids_controller.rb

  def create
    # byebug
    @auction = Auction.find(params[:auction_id])
    @bid = Bid.new bid_params
    @bid.auction_id = @auction.id
    @bid.user = current_user
    if @bid.save
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bids" ("price", "created_at", "updated_at", "user_id", "auction_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["price", 50.0], ["created_at", "2019-12-03 02:13:20.153116"], ["updated_at", "2019-12-03 02:13:20.153116"], ["user_id", 1], ["auction_id", 1]]